brew "ag"
brew "automake"
brew "autojump"
brew "ack"
brew "awscli"
brew "bash-completion"
brew 'bat' # a featurful cat replacement
brew "cmake" # for YouCompleteMe vim plugin
brew "command-tab-plus"
brew "coreutils" # for awesome commands like timeout
brew "ctags"
brew "diff-so-fancy"
brew "libvpx"
brew "exa"   # fast ls replacement written in Rust
brew "fd"
brew "ffmpeg" # for being able to manipulate videos for example
brew "findutils"
# brew "fish"
# brew "flake8" # for linting Python files
brew "fzf"
brew "fzy"
# brew "gifsicle" # for gif_compress fish function
brew "glances" # cli system monitor
brew "glow"    # markdown CLI renderer
brew "ghostscript"
brew 'gnuplot'
brew "gnu-tar"
brew "go"
brew "googler"                  # CLI google search tool
brew "graphicsmagick"
brew "grep"
brew "gs"
brew "pkg-config"
brew "hub"
brew "htop"
brew "hunspell"
brew "httpie"
brew "hunspell"
brew "imagemagick"
brew "jq"
brew "lf"    # console file manager written in go
brew "llvm"
brew "lynx"                     # CLI browser
brew "clang-format"
brew "mas"
brew "mdcat"  # CLI markdown renderer
#brew "mongodb-community"
brew "multimarkdown"
#brew "node"
brew "openssh"
brew "p7zip"
brew "parallel"
brew "poppler" # to work with pdf files and merge/extract them for example
brew "postgresql"
brew "prettier"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualwrapper"
#brew "python3"
#brew "python@2"
brew "pandoc"
brew "reattach-to-user-namespace" # for tmux commands to work
brew "redis"
brew "ripgrep"
brew "rag" # ripgrep, but also search in PDFs, E-Books, Office documents, zip, tar.gz, etc.
brew "rustup"
#brew "ruby" # for Vim command-t plugin to work
brew "shfmt" # formatter for shell mode
brew "starship" # customizable shell prompt written in Rust
brew "stormssh" # command line tool to manage your ssh connections
#brew "terraform"
brew "the_silver_searcher"
brew "thefuck"
brew "trash"
brew "tre" # modern tree replacement
brew "tree"
brew "twine-pypi" # for packaging Pypi packages, needed by setup.py repo
brew "vault"
#brew "vim", args: ["--with-override-system-vi"]
# brew "vim"
# brew "macvim"
brew "neovim"
brew "wget"
brew "wifi-password"
#brew "yarn"
brew "youtube-dl"
brew "z"
brew 'zsh-completions'
brew "srkomodo/tap/shadowfox-updater"

# fun
brew "fortune"
brew "cowsay"
brew "lolcat"

# help and info
# brew "tldr"
brew "tealdear" # fast tldr implementation in rust
brew "navi"  # fzf powered cheatsheet tool

# CLI File Managers
brew "broot" # a powerful directory explorer
brew "ranger"
brew "vifm"
brew "nnn"

# System info
brew "neofetch" # CLI sys info (term startup bling)
brew "dust"
brew "procs"

# terminal multiplexurs
brew "tmux"
brew "tmuxinator"
brew "tab"

# git and related
brew "git"
brew "git-extras"
brew "git-lfs"
brew "git-open"
brew "git-plus"
brew "gitbatch"
brew "gitgui"
brew "git-hound" # git plugin that helps prevent sensitive data from being committed into a repo
brew "tig" # ncurses-based text-mode interface for git
brew "gh"      # github CLI
brew "lazygit"
brew "onefetch" # git repo info similar to neofetch