# -*- mode: sh -*-

## shell ##
brew "autojump"
brew "bash-completion"
brew "starship" # customizable shell prompt written in Rust
brew "z"
brew 'zsh-completions'
brew "coreutils" # for awesome commands like timeout
brew "thefuck"
brew "trash"
brew "parallel"
brew "topgrade" # All-in-one upgrade tool
brew "nushell" # modern shell written in rust
brew "shellcheck" # A shell script static analysis tool
brew "xonsh" # Python based shell

## modern CLI tools ##
brew "ag"
brew "ack"
brew 'bat' # a featurful cat replacement
# brew "exa" # fast ls replacement written in Rust
brew "eza" # fast ls replacement written in Rust
brew "fd"
brew "sd" # replacement for sed
brew "findutils"
brew "fzf"
brew "ripgrep"
brew "rag" # ripgrep, but also search in PDFs, E-Books, Office documents, zip, tar.gz, etc.
brew "fzy"
brew "the_silver_searcher"
brew "tre" # modern tree replacement
brew "grep"
brew "xplr" # cli file manager written in rust
brew "zenith"
brew "hyperfine" #A command-line benchmarking tool
brew "rtx" # Polyglot runtime manager (asdf rust clone)

## CLI editors ##
#brew "vim", args: ["--with-override-system-vi"]
# brew "vim"
# brew "macvim"
brew "neovim"

## fun ##
brew "fortune"
brew "cowsay"
brew "lolcat"
brew "genact" # a random nonsense generator

## help and info ##
# brew "tldr"
brew "tealdear" # fast tldr implementation in rust
brew "navi"     # fzf powered cheatsheet tool
brew "cheat"    # CLI cheatsheets
brew "googler"  # CLI google search tool

## CLI File Managers ##
brew "broot" # a powerful directory explorer
brew "lf"    # console file manager written in go
brew "ranger"
brew "vifm"
brew "nnn"

## System info ##
brew "neofetch" # CLI sys info (term startup bling)
brew "dust"
brew "procs"
brew "htop"
brew "glances" # cli system monitor

## terminal multiplexurs ##
brew "tmux"
brew "tmuxinator"
brew "tab"
brew "zellij"

## git and related ##
brew "git"
brew "git-extras"
brew "git-lfs"
brew "git-open"
brew "git-plus"
brew "gitbatch"
brew "gitgui"
brew "git-hound" # git plugin that helps prevent sensitive data from being committed into a repo
brew "gitleaks"
brew "hub"
brew "tig" # ncurses-based text-mode interface for git
brew "gh"  # github CLI
brew "lazygit"
brew "gitui"
brew "onefetch" # git repo info similar to neofetch

## markdown, pdf, documentation, graphs etc. ##
brew "doxygen"
brew "graphviz"
brew "ghostscript"
brew "gs"
brew "mdcat" # CLI markdown renderer
brew "multimarkdown"
brew "poppler" # to work with pdf files and merge/extract them for example
brew "pandoc"
brew "glow"   # markdown CLI renderer
brew "slides" # markdown presentations in terminal
brew "ocrmypdf" # add ocr layer to scanned pdfs
brew "tesseract-lang" # languages for the ocrmypdf

## macos ##
brew "command-tab-plus"
brew "reattach-to-user-namespace" # for tmux commands to work
brew "mas"
brew "mac-cleanup-py"

## media - audio, video, images ##
brew "libvpx"
brew "ffmpeg" # for being able to manipulate videos for example
brew "graphicsmagick"
brew "imagemagick"
brew "youtube-dl"
brew "pngpaste"

## ssh ##
brew "openssh"
brew "stormssh" # command line tool to manage your ssh connections
brew "stormssh-completion"

## coding ##
brew "automake"
brew "awscli"
brew "bear" # compilation database generator for clang tooling
brew "bazelisk" # A user-friendly launcher for Bazel
brew "buildifier" # formatter for bazel build files
brew "ccache" # The compiler cache tool
brew "cmake" # The build generator for c, c++
brew "cloc"  # count code info
brew "tokei"  # count code info
brew "ninja" # Fast build engine
brew "cookiecutter"
# brew "ctags"
brew "universal-ctags/universal-ctags/universal-ctags", args: ['HEAD']
brew "diff-so-fancy"
brew 'gnuplot'
brew "go"
brew "rustup"
brew "pkg-config"
brew "llvm"
brew "clang-format"
brew "iwyu"
brew "cppcheck"
brew "lcov"
brew "octave"
brew "plantuml"
brew "postgresql"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualwrapper"
brew "pipx"       # Install common packages globally without polluting virtualenvs
brew "twine-pypi" # for packaging Pypi packages, needed by setup.py repo
#brew "terraform"
brew "jq"
#brew "mongodb-community"
#brew "node"
brew "uv" # An extremely fast Python package installer and resolver, written in Rus
brew "vault"
#brew "yarn"

## archive ##
brew "gnu-tar"
brew "p7zip"

## web, browser ##
brew "httpie"
brew "lynx" # CLI browser
brew "wget"
brew "srkomodo/tap/shadowfox-updater" # cross platform dark mode for firefox

## formatters, beautifiers, speel checkers ##
brew "prettier"
brew "shfmt" # formatter for shell mode
brew "hunspell"
