brew "automake"
brew "autojump"
brew "ack"
brew "awscli"
brew "bash-completion"
brew 'bat' # a featurful cat replacement
brew "broot" # a powerful directory explorer
brew "cmake" # for YouCompleteMe vim plugin
brew "command-tab-plus"
brew "coreutils" # for awesome commands like timeout
brew "ctags"
brew "diff-so-fancy"
brew "libvpx"
brew "fd"
brew "ffmpeg" # for being able to manipulate videos for example
brew "findutils"
# brew "fish"
brew "flake8" # for linting Python files
brew "fzf"
brew "fzy"
# brew "gifsicle" # for gif_compress fish function
brew "glances" # cli system monitor
brew "ghostscript"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "git-open"
brew 'gnuplot'
brew "gnu-tar"
brew "go"
brew "graphicsmagick"
brew "grep"
brew "gs"
brew "pkg-config"
brew "hub"
brew "htop"
brew "httpie"
brew "hunspell"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lf"    # console file manager written in go
brew "mas"
#brew "mongodb-community"
brew "multimarkdown"
#brew "node"
brew "openssh"
brew "p7zip"
brew "parallel"
brew "poppler" # to work with pdf files and merge/extract them for example
brew "postgresql"
brew "python3"
#brew "python@2"
brew "pandoc"
brew "poppler"
brew "reattach-to-user-namespace" # for tmux commands to work
brew "ranger"
brew "redis"
brew "ripgrep"
brew "rustup"
#brew "ruby" # for Vim command-t plugin to work
#brew "terraform"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "trash"
brew "tree"
brew "twine-pypi" # for packaging Pypi packages, needed by setup.py repo
brew "vault"
#brew "vim", args: ["--with-override-system-vi"]
# brew "vim"
brew "macvim"
brew "wget"
brew "wifi-password"
#brew "yarn"
brew "youtube-dl"
brew "z"
brew 'zsh-completions'
brew "srkomodo/tap/shadowfox-updater"
