cask 'appcleaner'
cask "emacs"
cask "inkscape"
cask "mark-text"
cask "yt-music"
#cask "1password"
#cask "1password-cli"
cask "alfred"
cask "avast-security"
#cask "bartender"
#cask "cyberduck"
cask "docker"
cask "dozer"
cask "dropbox"
#cask "fantastical"
#cask "firefox"
cask "font-fira-mono-for-powerline" # for iTerm2 powerline
cask "fork"
cask "foxitreader"
cask "gimp"
#cask "google-chrome"
#cask "google-cloud-sdk"
#cask "hammerspoon"
#cask "iina"
cask "insomnia"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
#cask "libreoffice"
#cask "ngrok"
#cask "nordvpn"
#cask "numi"
#cask "postico"
#cask "robo-3t"
#cask "slack"
#cask "spotify"
cask "sublime-text"
#cask "teamviewer"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "typora"
cask 'vlc'
#cask "zoomus"

# quicklook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "webpquicklook"
cask 'qlstephen'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
#cask 'betterzipql'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'
cask 'provisionql'
cask 'quicklookapk'
cask 'quicklook-pat'

#fonts
cask "font-arial"
cask "font-arial-black"
cask "font-microsoft-office"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-times-new-roman"
cask "font-verdana"
cask 'font-anonymice-powerline'
cask 'font-consolas-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-fira-mono-for-powerline'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-liberation-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-monofur-for-powerline'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-ubuntu-mono-derivative-powerline'
cask 'font-hack'
cask 'font-monoid'
