# -*- mode: sh -*-

## Terminals ##
cask 'alacritty'
cask 'kitty'
cask 'edex-ui' # fun bling terminal
cask "iterm2"

## media - audio, video, images ##
cask "inkscape"
cask "yt-music"
cask 'beardedspice'                 # control media including web players
cask "gimp"
cask 'vlc'
#cask "spotify"

## system info ##
cask 'cpuinfo'
cask 'iglance'
cask "oni"
cask "onyx"

## productivity ##
cask 'clipy'
cask "alfred"
cask 'cheatsheet'
cask "kap"                          # open source screen recorder
cask "karabiner-elements"
cask "insomnia"
#cask "bartender"


## editors (text, markdown) ##
cask "emacs"
cask "mark-text"
cask "mactex"
cask "sublime-text"
cask "vimr"
cask "typora"

## coding ##
cask "dash"
cask "fork"                         # free macos git frontend

# TODO:- create sections
cask 'appcleaner'
#cask "1password"
#cask "1password-cli"
# cask "avast-security"
#cask "cyberduck"
cask "docker"
cask "dozer"                        # hide statusbar icons, bartender alternative
cask "dropbox"
#cask "fantastical"
#cask "firefox"
cask "foxitreader"
#cask "google-chrome"
#cask "google-cloud-sdk"
#cask "hammerspoon"
#cask "iina"
cask "itsycal"
#cask "libreoffice"
#cask "ngrok"
#cask "nordvpn"
#cask "numi"
#cask "postico"
#cask "robo-3t"
cask "rectangle"
#cask "slack"
cask "spectacle"                    # open source window manager
#cask "teamviewer"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
#cask "zoomus"
# vim guis for mac

## quicklook plugins ##
cask "qlcolorcode"
cask "qlmarkdown"
cask "webpquicklook"
cask 'qlstephen'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
#cask 'betterzipql'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'
cask 'provisionql'
cask 'quicklookapk'
cask 'quicklook-pat'
cask 'jupyter-notebook-ql'

##fonts ##
cask "font-arial"
cask "font-arial-black"
cask "font-microsoft-office"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-times-new-roman"
cask "font-verdana"
cask 'font-anonymice-powerline'
cask 'font-consolas-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-fira-mono-for-powerline'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-liberation-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-monofur-for-powerline'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-sourcecodepro-nerd-font-mono'
cask 'font-ubuntu-mono-derivative-powerline'
cask 'font-hack'
cask 'font-monoid'
