tap "colindean/fonts-nonfree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/emacs"
tap "srkomodo/tap"
brew "automake"
brew "bash-completion"
brew "coreutils"
brew "emacs", link: false
brew "libvpx"
brew "ffmpeg"
brew "ghostscript"
brew "git"
brew "gnu-tar"
brew "go"
brew "pkg-config"
brew "hub"
brew "hunspell"
brew "imagemagick"
brew "joplin"
brew "lazygit"
brew "mas"
brew "pandoc"
brew "poppler"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "zsh"
brew "homebrew/emacs/markdown-mode"
brew "srkomodo/tap/shadowfox-updater"
cask "emacs"
cask "font-arial"
cask "font-arial-black"
cask "font-microsoft-office"
cask "font-times-new-roman"
cask "font-verdana"
cask "inkscape"
cask "mark-text"
cask "yt-music"
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Agenda", id: 1287445660
mas "Bear", id: 1091189122
mas "CalcTape", id: 945336271
mas "CotEditor", id: 1024640650
mas "Drafts", id: 1435957248
mas "Enpass", id: 732710998
mas "GoodNotes", id: 1480793815
mas "iA Writer", id: 775737590
mas "iThoughtsX", id: 720669838
mas "Keynote", id: 409183694
mas "Kiwi for Gmail", id: 986304488
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "MenuBar Stats", id: 714196447
mas "Notability", id: 736189492
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Todoist", id: 585829637
mas "WeatherBug", id: 1059074180
mas "WhatsApp", id: 1147396723
mas "Write", id: 848311469
mas "Xcode", id: 497799835
